package com.eomcs.basic.ex03;

//# 문자 리터럴
public class Exam0410{
    public static void main(String[] args){

      
    // 자바는 문자를 메모리에 저장할 때 Unicode 규칙에 따라 
    // 2바이트 코드로 저장한다.
    
    // println()
    // - 출력 값으로 문자 코드가 주어지면 해당 코드의 문자를
    // - 폰트 파일에서 찾아 출력한다.
      
    System.out.println('A');
    System.out.println('가');
    System.out.println('\u0041');
    System.out.println('\u4eba');
    // 그냥 숫자를 주면 println()은일반 정수값으로
    System.out.println(0x41);
    System.out.println(65);
    }
}

// 문자를 메모리에 저장하려면
// 2진수로 바꿀 수 있어야 한다.
// 문자를 2진수로 바꾸는 규칙을
// "문자집합(Character Set)" 이라 한다.
// - 문자 집합에는 여러 규칙이 있다.
//  - ASCII(7비트)
//  - 영어 대소문자, 숫자, 특수문자 등
//  - 'A' => 100_0001 = 0x41
//  - '1' => 011_0001 = 0x31
//  -한글은 정의되어 있지 않다.
//  -ISO-8859-1(8비트)
//      -ASCII 문자 + 유럽 문자
//  -EUC-KR(16비트,KSC-5601)
//      -한글 2350자에 대한 규칙
//      - '가' => 10110000
//      - 현대 통용되는 한글 음절 11172자를 모두 표현할 수 없다.
//  -Unicode(16비트)
//      - 영어, 한글 모두 2바이트로 표현
//      - 통용되는 모든 국가의 문자를 담고 있다
//      - 한글은 새로 정의했기 때문에 EUC-KR과 호환되지 않는다.
//  -UTF-8(Universal Coded Character Set + Transformation Format – 8-bit,8비트~32비트)
//      - Unicode에 있는 문자를 규칙에 따라 1 ~ 4 바이트로 변환한다.
//      - ISO-8859-1(영어, 숫자, 특수문자): 1바이트로 표현한다.
//      - 한글 : 3바이트로 표현한다.
//      - 문자에 따라 바이트 크기가 다르다.
//      - 기존의 ISO-8850-1은 1바이트로 표현한다.
//      - 한글은 규칙에 따라 3바이트로 변환한다.
//
//
// 폰트 
// 1) Raster 폰트(bitcamp 폰트)
// - 크기를 늘리면 계단현상 발생
// - 그림은 도트로 표현한다.
// - 출력 속도가 빠르다.
// - 단순한 그림이나 복잡한 그림이 파일 크기가 같다.
// - 왜? 천연색일 경우 각 점을 3바이트로 표현하기 때문이다.
//
// 2) Vector 폰트(truetype 폰트)
// - 크기를 늘려도 깔끔하게 출력
// - 폰트를 명령어로 저장한다.
// - 그릴 때 마다 명령어를 실행해야 하기 때문에 출력 속도가 느리다.
// - 그림이 복잡할수록 명령어가 복잡하기 때문에 파일 크기가 커진다.














